# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [5]:
# your code here
temp = pd.read_csv('Temp_States.csv')

#### Print `temp`.

In [6]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [7]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
your comments here
WE have object type for city and temperature and floats for temperature.
"""

#### Select the rows where state is New York.

In [18]:
# your code here
ny_temp = temp[temp['state'] == 'New York']
ny_temp

         City        State  Temperature     state
0         NYC     New York    19.444444  New York
1      Albany     New York     9.444444  New York
2     Buffalo     New York     3.333333  New York
3    Hartford  Connecticut    17.222222  New York
4  Bridgeport  Connecticut    14.444444  New York
5      Treton   New Jersey    22.222222  New York
6      Newark   New Jersey    20.000000  New York

#### What is the average temperature of cities in New York?

In [19]:
# your code here
ny_temp['Temperature'].mean()

15.158730158730156

#### Which states and cities have a temperature above 15 degrees Celsius?

In [22]:
# your code here
dg_15 = temp[temp['Temperature'] > 15]
dg_15

       City        State  Temperature     state
0       NYC     New York    19.444444  New York
3  Hartford  Connecticut    17.222222  New York
5    Treton   New Jersey    22.222222  New York
6    Newark   New Jersey    20.000000  New York


#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [24]:
# your code here
dg_15[['City', 'Temperature']]

       City  Temperature
0       NYC    19.444444
3  Hartford    17.222222
5    Treton    22.222222
6    Newark    20.000000

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [25]:
# your code here
temp[(temp['Temperature'] > 15) & (temp['Temperature'] < 20)][['City', 'Temperature']]

       City  Temperature
0       NYC    19.444444
3  Hartford    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [63]:
# your code here
temp.groupby(by='State').apply(lambda x: (x['Temperature'].mean(), x['Temperature'].std().))

AttributeError: 'float' object has no attribute 'to_frame'

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [27]:
# your code here
employees = pd.read_csv('Employee.csv')

#### Explore the data types of the `employees` dataframe. Comment your results.

In [64]:
# your code here
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        9 non-null      object
 1   Department  9 non-null      object
 2   Education   9 non-null      object
 3   Gender      9 non-null      object
 4   Title       9 non-null      object
 5   Years       9 non-null      int64
 6   Salary      9 non-null      int64
dtypes: int64(2), object(5)
memory usage: 632.0+ bytes

In [ ]:
"""
your comments here
5 columns with a object type and Years and Salary as integers
"""

#### What's the average salary in this company?

In [29]:
# your code here
employees.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

In [30]:
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [31]:
# your code here
employees['Salary'].max()

70

#### What's the lowest salary?

In [32]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [34]:
# your code here
employees[employees['Salary'] == 30]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [42]:
# your code here
david = employees['Name']=='David'
employees[david]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [43]:
# your code here
employees[david]['Salary']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [44]:
# your code here
associates = employees['Title'] == 'associate'
employees[associates]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [45]:
# Method 1
employees.head(3)
# your code here

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [46]:
# Method 2
employees.iloc[:3]
# your code here

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [50]:
# your code here
above_55 = (employees['Salary'] > 55) & (employees['Title'] == 'associate')
employees[above_55]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [52]:
# your code here
avg_group = employees.groupby('Years')['Salary'].mean()
avg_group.to_frame()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [53]:
# your code here
title_avg = employees.groupby('Title')['Salary'].mean()

####  Find the salary quartiles.

In [60]:
# your code here
quartiles = employees['Salary'].quantile([0.25, 0.5, 0.75])
quartiles.to_frame()

      Salary
0.25    35.0
0.50    55.0
0.75    60.0

#### Is the mean salary different per gender?

In [65]:
# your code here YES
gender = employees.groupby('Gender')['Salary'].mean()
diff = (gender['M'] - gender['F']) * 100/ gender['M']
print('The difference between Salarys in percentage is :', diff)

The difference between Salarys in percentage is : 5.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [66]:
# your code here
data = employees.groupby('Department').agg(['min','mean','max'])
data

           Years               Salary
             min      mean max    min   mean max
Department
HR             2  4.666667   8     30  45.00  70
IT             1  4.500000   8     30  48.75  70
Sales          2  2.500000   3     55  55.00  55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [69]:
# your code here
bonus = employees.groupby(by="Department")["Salary"].apply(lambda x: x.max()-x.min())
bonus.to_frame()

            Salary
Department
HR              40
IT              40
Sales            0

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here